Repository: dotnet/interactive
Catalog: src/Microsoft.DotNet.Interactive/xlf/Resources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# Magics_whos_Description
source: Display the names of the current top-level variables and their values.
cs: Zobrazí názvy aktuálních proměnných nejvyšší úrovně a jejich hodnoty.
de: Zeigt die Namen der aktuellen Variablen der obersten Ebene und deren Werte an.
es: Muestra los nombres de las variables de nivel superior actuales y sus valores.
fr: Permet d’afficher les noms des variables de niveau supérieur actuelles et leurs valeurs.
it: Visualizzare i nomi delle variabili di primo livello correnti e i relativi valori.
ja: 現在最上位レベルにある変数の名前とその値を表示します。
ko: 현재 최상위 변수의 이름과 해당 값을 표시합니다.
pl: Wyświetl nazwy bieżących zmiennych najwyższego poziomu i ich wartości.
pt_br: Exiba os nomes das variáveis de nível superior atuais e seus valores.
ru: Отображение имен текущих переменных верхнего уровня и их значений.
tr: Geçerli üst düzey değişkenlerin adlarını ve değerlerini görüntüleyin.
zh_hans: 显示当前顶级变量的名称及其值。
zh_hant: 顯示目前最頂層變數的名稱及其值。
