Repository: dotnet/interactive
Catalog: src/Microsoft.DotNet.Interactive/xlf/Resources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# FileDoesNotExist
source: File does not exist: '{0}'.
cs: Neexistující soubor: {0}
de: Die Datei ist nicht vorhanden: '{0}'.
es: El archivo no existe: "{0}"
fr: Le fichier n’existe pas : '{0}'.
it: Il file {0} non esiste
ja: ファイルが存在しません: '{0}'。
ko: '{0}' 파일이 없습니다.
pl: Plik nie istnieje: „{0}”.
pt_br: O arquivo não existe: "{0}".
ru: Файл не существует: "{0}".
tr: Dosya yok: '{0}'.
zh_hans: 文件不存在: '{0}'。
zh_hant: 檔案不存在: '{0}'。

# Magics_ErrorMessage_CannotBeUsedTogether
source: The {0} and {1} options cannot be used together.
cs: Možnosti {0} a {1} se nedají použít společně.
de: Die Optionen {0} und {1} können nicht zusammen verwendet werden.
es: Las opciones {0} y {1} no se pueden usar juntas.
fr: Les options {0} et {1} ne peuvent pas être utilisées ensemble.
it: Le opzioni {0} e {1} non possono essere usate insieme.
ja: {0} オプションと {1} オプションは同時に使用できません。
ko: {0} 및 {1} 옵션은 함께 사용할 수 없습니다.
pl: Opcji {0} i {1} opcji nie można używać razem.
pt_br: As opções {0} e {1} não podem ser usadas juntas.
ru: Параметры {0} и {1} не могут использоваться одновременно.
tr: {0} ve {1} seçenekleri birlikte kullanılamaz.
zh_hans: {0} 和 {1} 选项不能一起使用。
zh_hant: 無法同時使用 {0} 與 {1} 選項。

# Magics_import_Description
source: Runs another notebook or source code file inline.
cs: Spustí jiný vložený poznámkový blok nebo soubor zdrojového kódu.
de: Führt ein anderes Notebook oder eine Quellcodedatei inline aus.
es: Ejecuta otro archivo de código fuente o bloc de notas insertado.
fr: Exécute un autre bloc-notes ou fichier de code source inline.
it: Esegue un altro notebook o file di codice sorgente inline.
ja: 別のノートブックまたはソース コード ファイルをインラインで実行します。
ko: 다른 Notebook 또는 소스 코드 파일 인라인을 실행합니다.
pl: Uruchamia w tekście inny notes lub plik kodu źródłowego.
pt_br: Executa outro notebook ou arquivo de código-fonte embutido.
ru: Запускает другой встроенный файл записной книжки или исходного кода.
tr: Satır içi başka bir not defteri veya kaynak kodu dosyası çalıştırır.
zh_hans: 以内联方式运行另一个笔记本或源代码文件。
zh_hant: 執行另一個筆記本或原始程式碼檔案內嵌。

# Magics_import_file_Description
source: The path to the file to be imported. Supported file extensions include notebooks (.ipynb, .dib) as well as source code for supported languages (.cs, .csx, .fs, .fsx, .ps1, .html, .http, .js).
cs: Cesta k souboru, který se má importovat. Podporované přípony souborů zahrnují poznámkové bloky (.ipynb, .dib) a také zdrojový kód pro podporované jazyky (.cs, .csx, .fs, .fsx, .ps1, .html, .http, .js).
pt_br: O caminho do arquivo a ser importado. As extensões de arquivo com suporte incluem notebooks (.ipynb, .dib), bem como código-fonte para linguagens com suporte (.cs, .csx, .fs, .fsx, .ps1, .html, .http, .js).

# Magics_log_Description
source: Enables session logging.
cs: Povolí protokolování relace.
de: Aktiviert die Sitzungsprotokollierung.
es: Habilita el registro de sesión.
fr: Active la journalisation de session.
it: Abilita la registrazione della sessione.
ja: セッション ログの記録を有効にします。
ko: 세션 로깅을 사용합니다.
pl: Włącza rejestrowanie sesji.
pt_br: Habilita o registro em log de sessão.
ru: Включает ведение журнала сеанса.
tr: Oturum günlüğünü etkinleştirir.
zh_hans: 启用会话日志记录。
zh_hant: 啟用工作階段記錄。

# Magics_set_Description
source: Sets a value in the current kernel
cs: Nastaví hodnotu v aktuálním jádru.
de: Legt einen Wert im aktuellen Kernel fest
es: Establece un valor en el kernel actual
fr: Définit une valeur dans le noyau actuel
it: Imposta un valore nel kernel corrente
ja: 現在のカーネルに値を設定します
ko: 현재 커널의 값을 설정합니다.
pl: Ustawia wartość w bieżącym jądrze
pt_br: Define um valor no kernel atual
ru: Задает значение в текущем ядре
tr: Geçerli çekirdekte bir değer ayarlar
zh_hans: 在当前内核中设置值
zh_hant: 設定目前核心中的值

# Magics_set_ErrorMessage_SharingByReference
source: Sharing by reference is not allowed when kernels are remote.
cs: Pokud jsou jádra vzdálená, sdílení pomocí odkazu se nepovoluje.
de: Die Freigabe als Verweis ist nicht zulässig, wenn Kernel remote sind.
es: No se permite el uso compartido por referencia cuando los kernels son remotos.
fr: Le partage par référence n’est pas autorisé lorsque les noyaux sont distants.
it: La condivisione per riferimento non è consentita quando i kernel sono remoti.
ja: カーネルがリモートの場合、参照による共有は許可されません。
ko: 커널이 원격일 때는 참조로 공유할 수 없습니다.
pl: Udostępnianie przez referencję jest niedozwolone, gdy jądra są zdalne.
pt_br: O compartilhamento por referência não é permitido quando os kernels são remotos.
ru: Общий доступ по ссылке невозможен, если ядра являются удаленными.
tr: Çekirdekler uzak olduğunda başvuruyla paylaşıma izin verilmez.
zh_hans: 内核为远程时，不允许通过引用共享。
zh_hant: 當核心為遠端時，不允許以參照方式共用。

# Magics_set_byref_Description
source: Shares the specified value by reference if kernels are in the same process.
cs: Sdílí zadanou hodnotu pomocí odkazu, pokud jsou jádra ve stejném procesu.
de: Gibt den angegebenen Wert per Referenz frei, wenn sich die Kernel im selben Prozess befinden.
es: Comparte el valor especificado por referencia si los kernels están en el mismo proceso.
fr: Partage la valeur spécifiée par référence si les noyaux sont dans le même processus.
it: Condivide il valore specificato per riferimento se i kernel si trovano nello stesso processo.
ja: カーネルが同じプロセスにある場合に、指定した値を参照で共有します。
ko: 커널이 같은 프로세스에 있는 경우 지정된 값을 참조로 공유합니다.
pl: Udostępnia określoną wartość przez odwołanie, jeśli jądra są w tym samym procesie.
pt_br: Compartilha o valor especificado por referência se os kernels estão no mesmo processo.
ru: Предоставляет общий доступ к указанному значению по ссылке, если ядра находятся в одном процессе.
tr: Çekirdekler aynı işlemde ise belirtilen değeri başvuruya göre paylaşır.
zh_hans: 如果内核位于同一进程中，则通过引用共享指定的值。
zh_hant: 如果核心位於相同的流程，則以參照方式共用指定的值。

# Magics_set_mime_type_Description
source: The MIME type by which the value should be represented. This will often determine how an object will be formatted into a string.
cs: Typ MIME, podle kterého se má hodnota reprezentovat. Tato možnost často určuje, jak bude objekt formátován jako řetězec.
de: Der MIME-Typ, durch den der Wert dargestellt werden soll. Dadurch wird häufig bestimmt, wie ein Objekt in eine Zeichenfolge formatiert wird.
es: Tipo MIME por el que se debe representar el valor. Esto determinará a menudo cómo se formateará un objeto en una cadena.
fr: Type MIME par lequel la valeur doit être représentée. Cette opération détermine souvent comment un objet est formaté en chaîne.
it: Tipo MIME in base al quale deve essere rappresentato il valore. Questo spesso determina il modo in cui un oggetto verrà formattato in una stringa.
ja: 値の表現形式として使用する MIME の種類。多くの場合、オブジェクトを文字列で表現する際の形式がこれで決定されます。
ko: 값을 나타내야 하는 MIME 형식입니다. 많은 경우 이 형식은 개체가 문자열로 서식을 지정하는 방법을 결정합니다.
pl: Typ MIME, za pomocą którego powinna być reprezentowana wartość. To często określa sposób formatowania obiektu do ciągu.
pt_br: O tipo MIME pelo qual o valor deve ser representado. Isso geralmente determinará como um objeto será formatado em uma cadeia de caracteres.
ru: Тип MIME, в котором должно быть представлено значение. Это часто определяет, каким образом объект будет отформатирован в строку.
tr: Değerin temsil edileceği MIME türü. Bu, genellikle bir nesnenin dize olarak nasıl biçimlendirileceğini belirtir.
zh_hans: 应通过其表示值的 MIME 类型。这通常会确定如何将对象格式化为字符串。
zh_hant: 要以其表示值的 MIME 類型。這通常會決定物件如何格式化為字串。

# Magics_set_mime_type_ErrorMessage_CannotBeUsed
source: The --mime-type and --byref options cannot be used together.
cs: Možnosti --mime-type a --byref se nedají použít společně.
de: Die Optionen "--mime-type" und "--byref" können nicht zusammen verwendet werden.
es: Las opciones --mime-type y --byref no se pueden usar juntas.
fr: Les options --mime-type et --byref ne peuvent pas être utilisées ensemble.
it: Le opzioni --mime-type e --byref non possono essere usate insieme.
ja: --mime-type オプションと --byref オプションは同時に使用できません。
ko: --mime-type 및 --byref 옵션은 함께 사용할 수 없습니다.
pl: Opcji --mime-type i --byref nie można używać razem.
pt_br: As opções --mime-type e --byref não podem ser usadas juntas.
ru: Параметры --mime-type и --byref не могут использоваться одновременно.
tr: --mime-type ve --byref seçenekleri birlikte kullanılamaz.
zh_hans: --mime-type 和 --byref 选项不能一起使用。
zh_hant: --mime-type 和 --byref 選項不能同時使用。

# Magics_set_name_Description
source: The name of the value to be created in the current kernel.
cs: Název hodnoty, která se má vytvořit v aktuálním jádru
de: Der Name des Werts, der im aktuellen Kernel erstellt werden soll.
es: Nombre del valor que se creará en el kernel actual.
fr: Nom de la valeur à créer dans le noyau actuel.
it: Nome del valore da creare nel kernel corrente.
ja: 現在のカーネル内に作成する値の名前。
ko: 현재 커널에서 만들 값의 이름입니다.
pl: Nazwa wartości, która ma zostać utworzona w bieżącym jądrze.
pt_br: O nome do valor a ser criado no kernel atual.
ru: Имя значения, которое должно быть создано в текущем ядре.
tr: Geçerli çekirdekte oluşturulacak değerin adı.
zh_hans: 要在当前内核中创建的值名称。
zh_hant: 要在目前核心中建立的值名稱。

# Magics_set_value_Description
source: The value to be set. @input:user_prompt allows you to prompt the user for this value. Values can be requested from other kernels by name, for example @csharp:variableName.
cs: Hodnota, která se má nastavit. @input:user_prompt umožňuje o tuto hodnotu požádat uživatele. Hodnoty se mohou vyžadovat z jiných jader podle názvu, například @csharp:variableName.
de: Der festzulegende Wert. Mit @input:user_prompt können Sie den Benutzer zur Eingabe dieses Werts auffordern. Werte können von anderen Kerneln anhand des Namens angefordert werden, z. B. @csharp:variableName.
es: Valor que se va a establecer. @input:user_prompt permite solicitar este valor al usuario. Los valores se pueden solicitar desde otros kernels por nombre, por ejemplo, @csharp:variableName.
fr: Valeur à définir. @input:user_prompt vous permet de demander cette valeur à l’utilisateur. Les valeurs peuvent être demandées à partir d’autres noyaux par nom, par exemple @csharp:variableName.
it: Valore da impostare. @input:user_prompt consente di richiedere questo valore all'utente. I valori possono essere richiesti da altri kernel in base al nome, ad esempio @csharp:variableName.
ja: 設定する値。@input:user_prompt を使用すると、ユーザーにこの値の入力を求めるメッセージを表示できます。他のカーネルから名前を指定して値を要求することもできます (例: @csharp:variableName)。
ko: 설정할 값입니다. @input:user_prompt를 사용하면 사용자에게 이 값에 대한 메시지를 표시할 수 있습니다. 이름별로 다른 커널에서 값을 요청할 수 있습니다(예: @csharp:variableName).
pl: Wartość do ustawienia. @input:user_prompt umożliwia wyświetlenie użytkownikowi monitu o podanie tej wartości. Wartości można żądać od innych jąder według nazwy, na przykład @csharp:variableName.
pt_br: O valor a ser definido. @input:user_prompt permite solicitar esse valor ao usuário. Os valores podem ser solicitados de outros kernels por nome, por exemplo, @csharp:variableName.
ru: Значение, которое необходимо задать. @input:user_prompt позволяет запросить это значение у пользователя. Значения можно запрашивать из других ядер по имени, например, @csharp:variableName.
tr: Ayarlanacak değer. @input:user_prompt, kullanıcıya bu değeri sormanıza olanak sağlar. Diğer çekirdeklerden ada göre değer istenebilir, örneğin @csharp:variableName.
zh_hans: 要设置的值。@input:user_prompt 允许提示用户输入此值。可以按名称从其他内核请求值，例如 @csharp:variableName。
zh_hant: 要設定的值。@input:user_prompt 允許您提示使用者輸入此值。值可以依名稱從其他核心要求，例如 @csharp:variableName。

# Magics_share_Description
source: Get a value from one kernel and create a copy (or a reference if the kernels are in the same process) in another.
cs: Získat hodnotu z jednoho jádra a vytvořit kopii (nebo odkaz, pokud jsou jádra ve stejném procesu) v jádře jiném.
de: Rufen Sie einen Wert aus einem Kernel ab und erstellen Sie eine Kopie (oder einen Verweis, wenn sich die Kernel im selben Prozess befinden) in einem anderen.
es: Obtén un valor de un kernel y crea una copia (o una referencia si los kernels están en el mismo proceso) en otro.
fr: Obtenez une valeur d’un noyau et créez une copie (ou une référence si les noyaux sont dans le même processus) dans un autre.
it: Ottenere un valore da un kernel e creare una copia (o un riferimento se i kernel sono nello stesso processo) in un altro.
ja: 1 つのカーネルから値を取得し、別のカーネルにコピーを作成 (両方のカーネルが同じプロセス内にある場合は参照を作成) します。
ko: 한 커널에서 값을 가져와서 다른 커널에서 복사본(또는 커널이 같은 프로세스에 있는 경우 참조)을 만듭니다.
pl: Pobierz wartość z jednego jądra i utwórz kopię (lub odwołanie, jeśli jądra są w tym samym procesie) w innym.
pt_br: Obtenha um valor de um kernel e crie uma cópia (ou uma referência se os kernels estão no mesmo processo) em outro.
ru: Получение значения из одного ядра и создание копии (или ссылки, если ядра находятся в одном процессе) в другом ядре.
tr: Bir çekirdekten değer alın ve başka bir çekirdekte kopya (veya çekirdekler aynı işlemde ise başvuru) oluşturun.
zh_hans: 从一个内核获取一个值，并在另一个内核中创建一个副本(如果内核位于同一进程中，则创建一个引用)。
zh_hant: 從一個核心取得值，並在另一個核心建立副本 (或如果核心位於相同的流程時，則建立參照)。

# Magics_share_as_Description
source: The name to give the the value in the importing kernel.
cs: Název, který má zadat hodnotu v importu jádra
de: Der Name, der dem Wert im importierenden Kernel zugewiesen werden soll.
es: Nombre para dar el valor en el kernel que se importa.
fr: Nom auquel attribuer la valeur dans le noyau d’importation.
it: Nome da assegnare al valore nel kernel di importazione.
ja: インポート先カーネル内でその値に付ける名前。
ko: 가져오는 커널의 값에 지정할 이름입니다.
pl: Nazwa, która ma nadać wartość w jądrze importowania.
pt_br: O nome para dar o valor no kernel de importação.
ru: Имя переменной, которой будет присвоено значение, в ядре импорта.
tr: İçeri aktaran çekirdekteki değere verilecek ad.
zh_hans: 用于在导入内核中提供值的名称。
zh_hant: 要在匯入核心中指定值的名稱。

# Magics_share_from_Description
source: The name of the kernel to get the value from.
cs: Název jádra, ze kterého se má získat hodnota
de: Der Name des Kernels, aus dem der Wert abgerufen werden soll.
es: Nombre del kernel del que se obtendrá el valor.
fr: Nom du noyau à partir duquel obtenir la valeur.
it: Nome del kernel da cui ottenere il valore.
ja: 値の取得元カーネルの名前。
ko: 값을 가져올 커널의 이름입니다.
pl: Nazwa jądra, z którego ma zostać pobrana wartość.
pt_br: O nome do kernel do qual obter o valor.
ru: Имя ядра, из которого нужно получить значение.
tr: Değerin alınacağı çekirdeğin adı.
zh_hans: 要从中获取值的内核名称。
zh_hant: 要從中取得值的核心名稱。

# Magics_share_mime_type_Description
source: Share the value as a string formatted to the specified MIME type.
cs: Umožňuje sdílet hodnotu jako řetězec formátovaný se zadaným typem MIME.
de: Geben Sie den Wert als Zeichenfolge frei, die im angegebenen MIME-Typ formatiert ist.
es: Comparte el valor como una cadena con formato al tipo MIME especificado.
fr: Permet de partager la valeur sous la forme d’une chaîne au format du type MIME spécifié.
it: Condividere il valore come stringa formattata con il tipo MIME specificato.
ja: 指定した MIME の種類に適合する形式の文字列として値を共有します。
ko: 값을 지정한 MIME 형식으로 서식이 지정된 문자열로 공유합니다.
pl: Udostępnij wartość jako ciąg sformatowany do określonego typu MIME.
pt_br: Compartilhe o valor como uma cadeia de caracteres formatada para o tipo MIME especificado.
ru: Предоставление общего доступа к значению в виде строки, отформатированной для указанного типа MIME.
tr: Değeri, belirtilen MIME türüne biçimlendirilmiş bir dize olarak paylaşın.
zh_hans: 将值共享为格式化为指定 MIME 类型的字符串。
zh_hant: 以格式化為指定 MIME 類型的字串來共用值。

# Magics_share_name_Description
source: The name of the value to share. (This is also the default name of the value created in the destination kernel, unless --as is used to specify a different one.)
cs: Název hodnoty, která se má sdílet. (Toto je také výchozí název hodnoty vytvořené v cílovém jádru, pokud se k zadání jiné hodnoty nepoužívá --as.)
de: Der Name des freizugebenden Werts. (Dies ist auch der Standardname des im Zielkernel erstellten Werts, sofern nicht "--as" zum Angeben eines anderen Werts verwendet wird.)
es: Nombre del valor que se va a compartir. (Este es también el nombre predeterminado del valor creado en el kernel de destino, a menos que se use --as para especificar otro.)
fr: Nom de la valeur à partager. (Il s’agit également du nom par défaut de la valeur créée dans le noyau de destination, sauf si --as est utilisé pour en spécifier un autre.)
it: Nome del valore da condividere. (Si tratta anche del nome predefinito del valore creato nel kernel di destinazione, a meno che --as non venga usato per specificarne uno diverso.)
ja: 共有する値の名前 (宛先カーネルに作成される値にも、--as で別の名前を指定しない限り既定でこの名前が付けられます)。
ko: 공유할 값의 이름입니다(--as를 사용하여 다른 커널을 지정하지 않는 한 대상 커널에서 만든 값의 기본 이름이기도 합니다).
pl: Nazwa wartości do udostępnienia. (Jest to również domyślna nazwa wartości utworzonej w jądrze docelowym, chyba że parametr --as jest używany do określenia innej).
pt_br: O nome do valor a ser compartilhado. (Esse também é o nome padrão do valor criado no kernel de destino, a menos que --as seja usado para especificar um diferente.)
ru: Имя значения, к которому необходимо предоставить общий доступ. (Это имя также по умолчанию используется для значения, созданного в целевом ядре, если другое значение не указано с помощью параметра --as.)
tr: Paylaşılacak değerin adı. (Bu, farklı bir değer belirtmek için --as kullanılmıyorsa, hedef çekirdekte oluşturulan değerin varsayılan adıdır.)
zh_hans: 要共享的值的名称。(这也是在目标内核中创建的值的默认名称，除非 --as 用于指定其他名称。)
zh_hant: 要共用的值名稱。(這也是在目的地核心中建立之值的預設名稱，除非使用 --as 來指定不同的值。)

# Magics_value_from_file_Description
source: Specifies a file whose contents will be stored.
cs: Určuje soubor, jehož obsah se uloží.
de: Gibt eine Datei an, deren Inhalt gespeichert wird.
es: Especifica un archivo cuyo contenido se almacenará.
fr: Spécifie un fichier dont le contenu sera stocké.
it: Specifica un file il cui contenuto verrà archiviato.
ja: 格納するコンテンツの取得元ファイルを指定します。
ko: 콘텐츠를 저장할 파일을 지정합니다.
pl: Określa plik, którego zawartość będzie przechowywana.
pt_br: Especifica um arquivo cujo conteúdo será armazenado.
ru: Указывает файл, содержимое которого будет сохранено.
tr: İçeriği depolanacak bir dosya belirtir.
zh_hans: 指定将存储其内容的文件。
zh_hant: 指定將儲存其內容的檔案。

# Magics_value_from_url_Description
source: Specifies a URL whose content will be stored.
cs: Určuje adresu URL, jejíž obsah se uloží.
de: Gibt eine URL an, deren Inhalt gespeichert wird.
es: Especifica una dirección URL cuyo contenido se almacenará.
fr: Spécifie une URL dont le contenu sera stocké.
it: Specifica un URL il cui contenuto verrà archiviato.
ja: 保存するコンテンツの URL を指定します。
ko: 콘텐츠를 저장할 URL을 지정합니다.
pl: Określa adres URL, którego zawartość będzie przechowywana.
pt_br: Especifica uma URL cujo conteúdo será armazenado.
ru: Указывает URL-адрес, содержимое которого будет сохранено.
tr: İçeriği depolanacak bir URL belirtir.
zh_hans: 指定将存储其内容的 URL。
zh_hant: 指定將儲存其內容的 URL。

# Magics_value_from_value_Description
source: Specifies a value to be stored directly. Specifying @input:value allows you to prompt the user for this value.
cs: Určuje hodnotu, která se má uložit přímo. Pokud zadáte @input:value, můžete uživatele o zadání této hodnoty požádat.
de: Gibt einen Wert an, der direkt gespeichert werden soll. Wenn Sie @input:value angeben, können Sie den Benutzer zur Eingabe dieses Werts auffordern.
es: Especifica un valor que se va a almacenar directamente. Si especificas @input:value, podrás solicitar este valor al usuario.
fr: Spécifie une valeur à stocker directement. La spécification de @input:value vous permet de demander cette valeur à l’utilisateur.
it: Specifica un valore da archiviare direttamente. Se si specifica @input:value, è possibile richiedere questo valore all'utente.
ja: 格納する値を直接指定します。@input:value を指定すると、この値の入力をユーザーに求めるプロンプトを表示できます。
ko: 직접 저장할 값을 지정합니다. @input:value를 지정하면 사용자에게 이 값에 대한 메시지를 표시할 수 있습니다.
pl: Określa wartość, która ma być przechowywana bezpośrednio. Określenie wartości @input:value umożliwia wyświetlenie monitu o podanie tej wartości przez użytkownika.
pt_br: Especifica um valor a ser armazenado diretamente. Especificar @input:value permite solicitar esse valor ao usuário.
ru: Задает значение для непосредственного хранения. Указание @input:value позволяет запросить это значение у пользователя.
tr: Doğrudan depolanacak bir değer belirtir. @input:value belirtmek, kullanıcıya bu değeri sormanıza olanak sağlar.
zh_hans: 指定要直接存储的值。指定 @input:value 可提示用户输入此值。
zh_hant: 指定要直接儲存的值。指定 @input:value 可讓您提示使用者輸入此值。

# Magics_value_mime_type_Description
source: A mime type for the value. If specified, displays the value immediately as an output using the specified mime type.
cs: Typ MIME pro hodnotu. Pokud je zadán, hodnota se zobrazí okamžitě jako výstup pomocí zadaného typu MIME.
de: Ein MIME-Typ für den Wert. Bei Angabe dieser Option wird der Wert sofort als Ausgabe mit dem angegebenen MIME-Typ angezeigt.
es: Tipo MIME para el valor. Si se especifica, muestra el valor inmediatamente como una salida con el tipo MIME especificado.
fr: Type MIME pour la valeur. Si ce paramètre est spécifié, affiche immédiatement la valeur sous forme de sortie à l’aide du type MIME spécifié.
it: Tipo MIME per il valore. Se specificato, visualizza immediatamente il valore come output usando il tipo MIME specificato.
ja: 値の MIME の種類。これを指定すると、指定した MIME の種類に適合する出力形式ですぐに値を表示します。
ko: 값의 MIME 형식입니다. 지정하는 경우 지정한 MIME 형식을 사용하여 값을 출력으로 즉시 표시합니다.
pl: Typ mime dla wartości. W przypadku określenia wartość jest wyświetlana natychmiast jako dane wyjściowe przy użyciu określonego typu mime.
pt_br: Um tipo MIME para o valor. Se especificado, exibe o valor imediatamente como uma saída usando o tipo MIME especificado.
ru: Тип MIME для значения. Если этот параметр задан, значение отображается немедленно в виде выходных данных с использованием указанного типа MIME.
tr: Değer için mime türü. Belirtilmişse değeri, belirtilen mime türünü kullanan bir çıktı olarak hemen görüntüler.
zh_hans: 值的 MIME 类型。如指定，则使用指定的 MIME 类型立即将值显示为输出。
zh_hant: 值的 MIME 類型。若指定，會使用指定的 MIME 類型，立即將值顯示為輸出。

# Magics_value_name_Description
source: The name of the value to create. You can use #!share to retrieve this value from another subkernel.
cs: Název hodnoty, která se má vytvořit. Pomocí #!share můžete tuto hodnotu načíst z jiného podkernelu.
de: Der Name des zu erstellenden Werts. Sie können "#!share" verwenden, um diesen Wert aus einem anderen Unterkernel abzurufen.
es: Nombre del valor que se va a crear. Puedes usar #!share para recuperar este valor de otro subkernel.
fr: Nom de la valeur à créer. Vous pouvez utiliser #!share pour récupérer cette valeur à partir d’un autre sous-serveur.
it: Nome del valore da creare. È possibile usare #!share per recuperare questo valore da un altro sottokernel.
ja: 作成する値の名前。#!share を使用すると、この値を別のサブカーネルから取得できます。
ko: 만들 값의 이름입니다. #!share를 사용하여 다른 하위 커널에서 이 값을 검색할 수 있습니다.
pl: Nazwa wartości do utworzenia. Możesz użyć funkcji #!share, aby pobrać tę wartość z innego jądra podrzędnego.
pt_br: O nome do valor a ser criado. Você pode usar #!share para recuperar esse valor de outro subkernel.
ru: Имя создаваемого значения. Для получения этого значения из другого вложенного ядра можно использовать #!share.
tr: Oluşturulacak değerin adı. Bu değeri başka bir alt çekirdekten almak için #!share kullanın.
zh_hans: 要创建值的名称。可以使用 #!share 从另一个子存储库中检索此值。
zh_hant: 要建立之值的名稱。您可以使用 #!share 從其他子核心擷取此值。

# Magics_who_Description
source: Display the names of the current top-level variables.
cs: Zobrazí názvy aktuálních proměnných nejvyšší úrovně.
de: Zeigt die Namen der aktuellen Variablen der obersten Ebene an.
es: Muestra los nombres de las variables de nivel superior actuales.
fr: Permet d’afficher les noms des variables de niveau supérieur actuelles.
it: Visualizzare i nomi delle variabili di primo livello correnti.
ja: 現在最上位レベルにある変数の名前を表示します。
ko: 현재 최상위 변수의 이름을 표시합니다.
pl: Wyświetl nazwy bieżących zmiennych najwyższego poziomu.
pt_br: Exiba os nomes das variáveis de nível superior atuais.
ru: Отображение имен текущих переменных верхнего уровня.
tr: Geçerli üst düzey değişkenlerin adlarını görüntüleyin.
zh_hans: 显示当前顶级变量的名称。
zh_hant: 顯示目前最上層變數的名稱。
