Repository: dotnet/interactive
Catalog: src/dotnet-interactive/xlf/Resources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# Cli_ErrorMessageMustSpecifyPortRange
source: Must specify a port range
cs: Je nutné zadat rozsah portů.
de: Es muss ein Portbereich angegeben werden
es: Debes especificar un intervalo de puertos
fr: Vous devez spécifier une plage de ports
it: Specificare un intervallo di porte
ja: ポート範囲を指定する必要があります
ko: 포트 범위를 지정해야 합니다.
pl: Należy określić zakres portów
pt_br: É necessário especificar um intervalo de portas
ru: Необходимо указать диапазон портов
tr: Bağlantı noktası aralığı belirtilmelidir
zh_hans: 必须指定端口范围
zh_hant: 必須指定連接埠範圍

# Cli_ErrorMessage_MustSpecifyPortRangeAsStartPortEndPort
source: Must specify a port range as StartPort-EndPort
cs: Rozsah portů je nutné zadat jako StartPort-EndPort.
de: Es muss ein Portbereich als StartPort-EndPort angegeben werden
es: Debes especificar un intervalo de puertos como StartPort-EndPort
fr: Vous devez spécifier une plage de ports comme StartPort-EndPort
it: Deve specificare un intervallo di porte come StartPort-EndPort
ja: ポート範囲を StartPort-EndPort の形式で指定してください
ko: 포트 범위를 StartPort-EndPort로 지정해야 합니다.
pl: Należy określić zakres portów jako StartPort-EndPort
pt_br: É necessário especificar um intervalo de portas como StartPort-EndPort
ru: Необходимо указать диапазон портов в виде "начальный порт-конечный порт"
tr: StartPort-EndPort olarak bağlantı noktası aralığı belirtilmelidir
zh_hans: 必须将端口范围指定为 StartPort-EndPort
zh_hant: 必須將連接埠範圍指定為 StartPort-EndPort

# Cli_ErrorMessage_StartPortMustBeLower
source: Start port must be lower then end port
cs: Počáteční port musí být nižší než koncový port.
de: Der Startport muss niedriger als der Endport sein
es: El puerto de inicio debe ser inferior al puerto final
fr: Le port de début doit être inférieur au port de fin
it: La porta di avvio deve essere inferiore alla porta finale
ja: 開始ポートは終了ポートより小さい番号にする必要があります
ko: 시작 포트는 끝 포트보다 낮아야 합니다.
pl: Port początkowy musi być niższy niż port końcowy
pt_br: A porta inicial deve ser inferior à porta final
ru: Начальный порт должен быть меньше конечного порта
tr: Başlangıç bağlantı noktası bitiş bağlantı noktasından daha küçük olmalıdır
zh_hans: 起始端口必须小于结束端口
zh_hant: 開始連接埠必須低於結束連接埠

# Cli_dotnet_interactive_Description
source: Interactive programming for .NET.
cs: Interaktivní programování pro platformu .NET
de: Interaktive Programmierung für .NET.
es: Programación interactiva para .NET.
fr: Programmation interactive pour .NET.
it: Programmazione interattiva per .NET.
ja: .NET の対話型プログラミング。
ko: .NET에 대한 대화형 프로그래밍입니다.
pl: Programowanie interakcyjne dla platformy .NET.
pt_br: Programação interativa para .NET.
ru: Интерактивное программирование для .NET.
tr: .NET için etkileşimli programlama.
zh_hans: .NET 的交互式编程。
zh_hant: .NET 的互動式程式設計。

# Cli_dotnet_interactive_jupyter_Description
source: Starts dotnet-interactive as a Jupyter kernel
cs: Spustí dotnet-interactive jako jádro Jupyter.
de: Startet dotnet-interactive als Jupyter-Kernel
es: Inicia dotnet-interactive como kernel de Jupyter
fr: Démarre dotnet-interactive en tant que noyau Jupyter
it: Avvia dotnet-interactive come kernel Jupyter
ja: Jupyter カーネルとして dotnet-interactive を起動します
ko: dotnet-interactive을 Jupyter 커널로 시작합니다.
pl: Uruchamia narzędzie dotnet-interactive jako jądro Jupyter
pt_br: Inicia dotnet-interactive como um kernel do Jupyter
ru: Запускает dotnet-interactive в качестве ядра Jupyter
tr: Dotnet-interactive'i Jupyter çekirdeği olarak başlatır
zh_hans: 启动 dotnet-interactive 作为 Jupyter 内核
zh_hant: 以 Jupyter 核心啟動 dotnet-interactive

# Cli_dotnet_interactive_jupyter_connection_file_Description
source: The path to a connection file provided by Jupyter
cs: Cesta k souboru připojení, který poskytuje Jupyter.
de: Der Pfad zu einer von Jupyter bereitgestellten Verbindungsdatei
es: Ruta de acceso a un archivo de conexión proporcionado por Jupyter
fr: Chemin d’accès à un fichier de connexion fourni par Jupyter
it: Percorso di un file di connessione fornito da Jupyter
ja: Jupyter から提供された接続ファイルへのパス
ko: Jupyter에서 제공하는 연결 파일의 경로입니다.
pl: Ścieżka do pliku połączenia dostarczonego przez program Jupyter
pt_br: O caminho para um arquivo de conexão fornecido pelo Jupyter
ru: Путь к файлу подключения, предоставленному Jupyter
tr: Jupyter tarafından sağlanan bağlantı dosyasının yolu
zh_hans: Jupyter 提供的连接文件路径
zh_hant: Jupyter 所提供之連線檔案的路徑

# Cli_dotnet_interactive_jupyter_default_kernel_Description
source: The default language for the kernel
cs: Výchozí jazyk jádra
de: Die Standardsprache für den Kernel
es: El idioma predeterminado del kernel
fr: La langue par défaut du noyau
it: Lingua predefinita per il kernel
ja: カーネルの既定の言語
ko: 커널의 기본 언어
pl: Domyślny język jądra
pt_br: O idioma padrão para o kernel
ru: Язык по умолчанию для ядра
tr: Çekirdek için varsayılan dil
zh_hans: 内核默认语言
zh_hant: 核心的預設語言

# Cli_dotnet_interactive_jupyter_install_Description
source: Install the .NET kernel for Jupyter
cs: Nainstalovat jádro platformy .NET pro Jupyter
de: .NET-Kernel für Jupyter installieren
es: Instalar el kernel de .NET para Jupyter
fr: Installer le noyau .NET pour Jupyter
it: Installare il kernel .NET per Jupyter
ja: Jupyter 用の .NET カーネルをインストールします
ko: Jupyter용 .NET 커널 설치
pl: Zainstaluj jądro platformy .NET dla programu Jupyter
pt_br: Instalar o kernel do .NET para Jupyter
ru: Установить ядро .NET для Jupyter
tr: Jupyter için .NET çekirdeğini yükle
zh_hans: 安装适用于 Jupyter 的 .NET 内核
zh_hant: 安裝適用於 Jupyter 的 .NET 核心

# Cli_dotnet_interactive_jupyter_install_http_port_range_Description
source: Specifies the range of ports to use to enable HTTP services
cs: Určuje rozsah portů, které se mají použít k povolení služeb HTTP.
de: Gibt den Portbereich an, der zum Aktivieren von HTTP-Diensten verwendet werden soll
es: Especifica el intervalo de puertos que se usarán para habilitar los servicios HTTP
fr: Spécifie la plage de ports à utiliser pour activer les services HTTP
it: Specifica l'intervallo di porte da utilizzare per abilitare i servizi HTTP
ja: HTTP サービスを有効にするために使用するポート範囲を指定します
ko: HTTP 서비스를 지원하는 데 사용할 포트 범위를 지정합니다.
pl: Określa zakres portów do użycia w celu włączenia usług HTTP
pt_br: Especifica o intervalo de portas a serem usadas para habilitar serviços HTTP
ru: Задает диапазон портов, используемых для включения служб HTTP
tr: HTTP hizmetlerini etkinleştirmek için kullanılacak bağlantı noktası aralığını belirtir
zh_hans: 指定用于启用 HTTP 服务的端口范围
zh_hant: 指定要用來啟用 HTTP 服務的連接埠範圍

# Cli_dotnet_interactive_jupyter_install_path_Description
source: Installs the kernel specs to the specified directory
cs: Nainstaluje specifikace jádra do zadaného adresáře.
de: Installiert die Kernelspezifikationen im angegebenen Verzeichnis
es: Instala las especificaciones del kernel en el directorio especificado
fr: Installe les spécifications du noyau dans le répertoire spécifié
it: Installa le specifiche del kernel nella directory specificata
ja: 指定したディレクトリにカーネル仕様をインストールします
ko: 지정한 디렉터리에 커널 사양을 설치합니다.
pl: Instaluje specyfikacje jądra w określonym katalogu
pt_br: Instala as especificações de kernel no diretório especificado
ru: Устанавливает спецификации ядра в указанный каталог
tr: Çekirdek belirtimlerini belirtilen dizine yükler
zh_hans: 将内核规格安装到指定目录
zh_hant: 將核心規格安裝到指定的目錄

# Cli_dotnet_interactive_log_path_Description
source: Enable file logging to the specified directory
cs: Povolit protokolování souborů do zadaného adresáře
de: Dateiprotokollierung im angegebenen Verzeichnis aktivieren
es: Habilitar el registro de archivos en el directorio especificado
fr: Activer la journalisation des fichiers dans le répertoire spécifié
it: Abilitare la registrazione file nella directory specificata
ja: 指定されたディレクトリのファイルへのログ記録を有効にする
ko: 지정한 디렉터리에 파일 로깅 사용
pl: Włącz rejestrowanie plików w określonym katalogu
pt_br: Habilitar o registro em log de arquivos para o diretório especificado
ru: Включить ведение журнала файлов в указанном каталоге
tr: Belirtilen dizine dosya günlük kaydını etkinleştir
zh_hans: 启用文档日志到指定目录
zh_hant: 啟用檔案記錄到指定的目錄

# Cli_dotnet_interactive_notebook_parser_Description
source: Starts a process to parse and serialize notebooks.
cs: Spustí proces parsování a serializace poznámkových bloků.
de: Startet einen Prozess zum Analysieren und Serialisieren von Notebooks.
es: Inicia un proceso para analizar y serializar blocs de notas.
fr: Démarre un processus d’analyse et de sérialisation des blocs-notes.
it: Avvia un processo per analizzare e serializzare i notebook.
ja: ノートブックを解析およびシリアル化するプロセスを起動します。
ko: Notebook을 구문 분석하고 직렬화하는 프로세스를 시작합니다.
pl: Uruchamia proces analizowania i serializowania notesów.
pt_br: Inicia um processo para analisar e serializar notebooks.
ru: Запускает процесс анализа и сериализации записных книжек.
tr: Not defterlerini ayrıştırma ve seri hale getirme işlemini başlatır.
zh_hans: 启动分析和序列化笔记本的进程。
zh_hant: 開始剖析和序列化筆記本的流程。

# Cli_dotnet_interactive_stdio_Description
source: Starts dotnet-interactive with kernel functionality exposed over standard I/O
cs: Spustí dotnet-interactive s funkcemi jádra zveřejněnými přes standardní vstupně-výstupní operace.
de: Startet "dotnet-interactive" mit Kernelfunktionalität, die über Standard-E/A verfügbar gemacht wird
es: Inicia dotnet-interactive con la funcionalidad del kernel expuesta a través de E/S estándar
fr: Démarre dotnet-interactive avec les fonctionnalités du noyau exposées sur les E/S standard
it: Avvia dotnet-interactive con funzione kernel esposta tramite I/O standard
ja: dotnet-interactive を起動し、標準入出力を使用してカーネル機能を提供します
ko: 표준 I/O를 통해 노출되는 커널 함수로 dotnet-interactive를 시작합니다.
pl: Uruchamia narzędzie dotnet-interactive z funkcją jądra eksponowaną za pomocą standardowych we/wy
pt_br: Inicia dotnet-interactive com função de kernel exposta por padrão E/S
ru: Запускает dotnet-interactive с функциями ядра, предоставляемыми через стандартные операции ввода-вывода
tr: Dotnet-interactive’i standart G/Ç üzerinden sunulan çekirdek işlevselliğiyle başlatır
zh_hans: 使用通过标准 I/O 公开的内核功能启动 dotnet 交互
zh_hant: 使用透過標準 I/O 公開的核心功能啟動 dotnet-interactive

# Cli_dotnet_interactive_stdio_http_port_Description
source: Specifies the port on which to enable HTTP services
cs: Určuje port, na kterém se mají povolit služby HTTP.
de: Gibt den Port an, an dem HTTP-Dienste aktiviert werden sollen
es: Especifica el puerto en el que se habilitarán los servicios HTTP
fr: Spécifie le port sur lequel activer les services HTTP
it: Specifica la porta su cui abilitare i servizi HTTP
ja: HTTP サービスを有効にするポートを指定します
ko: HTTP 서비스를 지원할 포트를 지정합니다.
pl: Określa port, na którym mają być włączone usługi HTTP
pt_br: Especifica a porta na qual habilitar serviços HTTP
ru: Указывает порт, на котором должны быть включены службы HTTP
tr: HTTP hizmetlerinin etkinleştirileceği bağlantı noktasını belirtir
zh_hans: 指定要在其中启用 HTTP 服务的端口
zh_hant: 指定要啟用 HTTP 服務的連接埠

# Cli_dotnet_interactive_stdio_http_port_ErrorMessageCannotSpecifyBoth
source: Cannot specify both {0} and {1} together
cs: Nedá se zadat současně {0} i {1}.
de: Sowohl {0} als auch {1} können nicht gemeinsam angegeben werden
es: No se pueden especificar {0} y {1} juntos
fr: Nous n’avons pas pu spécifier les {0} et les {1} ensemble
it: Non è possibile specificare sia {0} che {1} insieme
ja: {0} と {1} の両方を同時に指定することはできません
ko: {0} 및 {1}은(는) 함께 지정할 수 없습니다.
pl: Nie można określić jednocześnie {0} i {1} razem
pt_br: Não é possível especificar {0} e {1} juntas
ru: {0} и {1} не могут быть указаны одновременно
tr: Aynı anda hem {0} hem de {1} belirtilemez
zh_hans: 无法同时指定 {0} 和 {1}
zh_hant: 無法同時指定 {0} 和 {1}

# Cli_dotnet_interactive_stdio_http_port_ErrorMessageMustSpecifyPortNumber
source: Must specify a port number or *.
cs: Je nutné zadat číslo portu nebo *.
de: Es muss eine Portnummer oder * angegeben werden.
es: Debes especificar un número de puerto o *.
fr: Vous devez spécifier un numéro de port ou *.
it: Specificare un numero di porta o *.
ja: ポート番号または * を指定する必要があります。
ko: 포트 번호 또는 *를 지정해야 합니다.
pl: Należy określić numer portu lub znak *.
pt_br: É necessário especificar um número de porta ou *.
ru: Необходимо указать номер порта или *.
tr: Bağlantı noktası numarası veya * belirtilmelidir.
zh_hans: 必须指定端口号或 *。
zh_hant: 必須指定連接埠號碼或 *。

# Cli_dotnet_interactive_stdio_http_port_range_Description
source: Specifies the range of ports to use to enable HTTP services
cs: Určuje rozsah portů, které se mají použít k povolení služeb HTTP.
de: Gibt den Portbereich an, der zum Aktivieren von HTTP-Diensten verwendet werden soll
es: Especifica el intervalo de puertos que se usarán para habilitar los servicios HTTP
fr: Spécifie la plage de ports à utiliser pour activer les services HTTP
it: Specifica l'intervallo di porte da utilizzare per abilitare i servizi HTTP
ja: HTTP サービスを有効にするために使用するポート範囲を指定します
ko: HTTP 서비스를 지원하는 데 사용할 포트 범위를 지정합니다.
pl: Określa zakres portów do użycia w celu włączenia usług HTTP
pt_br: Especifica o intervalo de portas a serem usadas para habilitar serviços HTTP
ru: Задает диапазон портов, используемых для включения служб HTTP
tr: HTTP hizmetlerini etkinleştirmek için kullanılacak bağlantı noktası aralığını belirtir
zh_hans: 指定用于启用 HTTP 服务的端口范围
zh_hant: 指定要用來啟用 HTTP 服務的連接埠範圍

# Cli_dotnet_interactive_stdio_kernel_host_Description
source: Name of the kernel host.
cs: Název hostitele jádra
de: Name des Kernelhosts.
es: Nombre del host del kernel.
fr: Nom de l’hôte du noyau.
it: Nome dell'host del kernel.
ja: カーネル ホストの名前。
ko: 커널 호스트의 이름입니다.
pl: Nazwa hosta jądra.
pt_br: Nome do host do kernel.
ru: Имя узла ядра.
tr: Çekirdek ana bilgisayarının adı.
zh_hans: 内核主机的名称。
zh_hant: 核心主機的名稱。

# Cli_dotnet_interactive_stdio_preview_Description
source: Enable preview kernel features.
cs: Povolte funkce jádra ve verzi Preview.
de: Vorschaukernelfeatures aktivieren.
es: Habilitar la versión preliminar de las características del kernel.
fr: Activez les fonctionnalités en préversion du noyau.
it: Abilitare le funzionalità del kernel di anteprima.
ja: プレビュー カーネル機能を有効にします。
ko: 미리 보기 커널 기능을 사용합니다.
pl: Włącz funkcje jądra w wersji zapoznawczej.
pt_br: Habilite a versão prévia dos recursos do kernel.
ru: Включить предварительные версии компонентов ядра.
tr: Önizleme çekirdek özelliklerini etkinleştirin.
zh_hans: 启用预览内核功能。
zh_hant: 啟用預覽核心功能。

# Cli_dotnet_interactive_stdio_working_directory_Description
source: Working directory to which to change after launching the kernel.
cs: Pracovní adresář, na který se má po spuštění jádra změnit
de: Arbeitsverzeichnis, in das nach dem Starten des Kernels geändert werden soll.
es: Directorio de trabajo al que cambiar después de iniciar el kernel.
fr: Répertoire de travail vers lequel changer après le lancement du noyau.
it: Directory di lavoro in cui effettuare la modifica dopo l'avvio del kernel.
ja: カーネルの起動後に使用する移動先の作業ディレクトリ。
ko: 커널을 시작한 후 변경할 작업 디렉터리입니다.
pl: Katalog roboczy, do którego ma zostać zmieniona zmiana po uruchomieniu jądra.
pt_br: Diretório de trabalho para o qual alterar depois de iniciar o kernel.
ru: Рабочий каталог, в который следует перейти после запуска ядра.
tr: Çekirdek başlatıldıktan sonra değiştirilecek çalışma dizini.
zh_hans: 启动内核后要更改的工作目录。
zh_hant: 啟動核心後要變更的工作目錄。

# Cli_dotnet_interactive_verbose_Description
source: Enable verbose logging to the console
cs: Povolit podrobné protokolování do konzoly
de: Ausführliche Protokollierung in der Konsole aktivieren
es: Habilitar el registro detallado en la consola
fr: Activer la journalisation détaillée sur la console
it: Abilitare la registrazione dettagliata relativamente alla console
ja: コンソールへの詳細なログ記録を有効にする
ko: 콘솔에 자세한 정보 로깅 사용
pl: Włącz pełne rejestrowanie w konsoli
pt_br: Habilitar o registro em log detalhado no console
ru: Включить подробное ведение журнала в консоли
tr: Konsola ayrıntılı günlük kaydını etkinleştir
zh_hans: 启用详细记录至控制台
zh_hant: 啟用詳細資訊記錄到主控台

# Magics_about_Description
source: Show version and build information
cs: Zobrazit informace o verzi a buildu
de: Versions- und Buildinformationen anzeigen
es: Mostrar información de versión y compilación
fr: Afficher les informations de version et de build
it: Mostra informazioni su versione e build
ja: バージョンとビルドの情報を表示する
ko: 버전 및 빌드 정보 표시
pl: Pokaż informacje o wersji i kompilacji
pt_br: Mostrar informações de versão e build
ru: Показать сведения о версии и сборке
tr: Sürüm ve derleme bilgilerini göster
zh_hans: 显示版本并生成信息
zh_hant: 顯示版本和組建資訊
